HeleShaw_Caso1/HeleShaw1/system/parameters

//Velocity
inletVelocity (6.06e-4 0 0); // CHECK

//transport values 
nu 0.89e-3; // CHECK

